{
  "projects": [
    {
      "title": "Shelf Life",
      "description": "Shelf Life was a project I worked on with a team of coders for our final project at the University of Minnesota Full Stack Coding Boot Camp. It included a login, a function to look up and add books to your reading diary, and an interface where the user can arrange the books on a digital bookshelf any way they see fit. It's meant not only as a reading log but as a creative outlet.",
      "shortDescription": "Your digital bookcase",
      "techs": ["React", "Recoil", "Node.js", "Express", "MongoDb", "graphQL"],
      "url": "https://shelf-life.herokuapp.com",
      "repo": "https://github.com/lkalliance/shelf-life",
      "image": "./images/shelf-life-screenshot.png"
    },
    {
      "title": "Be For Reel",
      "description": "Be For Reel was a project I worked on as the leader of a five-person team in the University of Minnesota Full Stack Coding Boot Camp. It included a username/password login, poll creation tools tied into IMDb's public API, and polls enriched with IMDb data. Users could submit a comment with their vote. The front page displayed six randomly-chosen polls, with the movie poster of one of its randomly-chosen options. Users each had a profile page, which showed all their created quizzes and all their submitted comments. The current version is completely rewritten in React.js, with a MongoDB and GraphQL back end.",
      "shortDescription": "A movie poll site powered by IMDb",
      "techs": [
        "React.js",
        "Node.js",
        "Express",
        "MongoDB",
        "Mongoose",
        "Bootstrap"
      ],
      "url": "https://be-4-reel-9f2cbf237830.herokuapp.com",
      "repo": "https://github.com/lkalliance/Be-For-Reel",
      "image": "./images/be-for-reel-3.png"
    },
    {
      "title": "Dragging Exercise",
      "description": "I was planning a web-based interface for a product, and I created this snippet of code in vanilla Javascript as a proof of concept. No libraries or frameworks. Drag the ten-second strip to navigate or click on the full disclosure below it. Control-click to create a report strip, or option-click-drag to create movable calipers to measure heart rate. This project was never begun beyond this.",
      "shortDescription": "A JavaScript exercise in interactions",
      "techs": ["HTML", "CSS", "JavaScript"],
      "url": "https://lkalliance.github.io/old-dragging/",
      "repo": "https://github.com/lkalliance/old-dragging",
      "image": "./images/dragging.png"
    }
  ]
}
